app/controllers/authors_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 2]]
---
  def post
    @post = Post.find(params[:post_id])